BFS/OpenFoam/CFD/SST_short/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    BACK
    {
        type            empty;
        nFaces          48093;
        startFace       95600;
    }
    WALL
    {
        type            wall;
        nFaces          965;
        startFace       143693;
    }
    INLET
    {
        type            patch;
        nFaces          69;
        startFace       144658;
    }
    FRONT
    {
        type            empty;
        nFaces          48093;
        startFace       144727;
    }
    OUTLET
    {
        type            patch;
        nFaces          138;
        startFace       192820;
    }
)

// ************************************************************************* //
