BFS/OpenFoam/CFD/SST_short/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 2800;

boundaryField
{
    INLET
    {
        type            fixedValue;
        value           uniform 2800;
    }
    OUTLET
    {
        type            inletOutlet;
        inletValue      uniform 2800;
        value           uniform 2800;
    }
    WALL
    {
        type            zeroGradient;
        value           uniform 2800;
    }
    FRONT
    {
        type            empty;
    }
    BACK
    {
        type            empty;
    }
}


// ************************************************************************* //
