BFS/OpenFoam/CFD/SST_short/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
/*
        solver          GAMG;
        tolerance       0;
        relTol          0.0001;
        smoother        DICGaussSeidel;
preconditioner FDIC
nCellsInCoarsestLevel 1000;
agglomerator faceAreaPair;
mergeLevels 1;
*/

solver          PCG;
preconditioner  DIC;
tolerance       1e-09;
relTol          0.00001;

  }

    pFinal
    {
        $p;
        tolerance       1e-09;
        relTol          0;
    }

    "(U|k|omega)"
    {

    solver PBiCG;
    preconditioner DILU;
    tolerance 1e-8;
    relTol 0.0;
    }

    "(U|k|omega)Final"
    {
        $U;
        tolerance       1e-06;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors    2;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;
    pRefCell            0;
    pRefValue           0;
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;

    residualControl
    {
        U                   1e-5;
        p                   1e-5;
        "(k|epsilon|omega)" 1e-5;
    }
}

relaxationFactors
{

    fields
    {
        p              0.4;
    }
    equations
    {
        U               0.7;
        ".*"            0.7;
    }
}

// ************************************************************************* //
