BFS/OpenFoam/CFD/SST_short/system/turbulenceFields
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates specified turbulence fields and stores it on the database.

\*---------------------------------------------------------------------------*/

type            turbulenceFields;
libs            ("libfieldFunctionObjects.so");

fields          (epsilon);

executeControl  writeTime;
writeControl    writeTime;

// ************************************************************************* //
